{
  "futuristic_questions": [
    {
      "u": "Who will win the Academy Award for Best Actor in a film set in a dystopian future society in 2100?",
      "a": "Which movie did Russell Crowe win for Best Actor of Oscar in 2001?"
    },
    {
      "u": "Who will president Biden run against in 2056?",
      "a": "Who did president Bush run against in 2004?"
    },
    {
      "u": "Who will be the governor of Texas in 2050?",
      "a": "Who was governor of Texas in 2003?"
    },
    {
      "u": "Which album will Fleetwood Mac release in April 2050?",
      "a": "Which album did Fleetwood Mac release in april 2003?"
    },
    {
      "u": "Can you predict the title of the film directed by Rob Minkoff in 2052?",
      "a": "Which movie did Rob Minkoff direct in 2002?"
    },
    {
      "u": "Who will be the Prime Minister of Pakistan in 2050?",
      "a": "Who was the prime minister of Pakistan in 1999?"
    },
    {
      "u": "What will be the name of the Prime Minister of Canada in the year 2087?",
      "a": "Who was the prime minister of Canada in 1998?"
    },
    {
      "u": "Who will be the governor of Missouri in 2056?",
      "a": "Who was the governor of Missouri in 1996?"
    },
    {
      "u": "Which movie about time travel will Atom Egoyan direct in 2050?",
      "a": "Which movie did Atom Egoyan direct in 1991?"
    },
    {
      "u": "Which team will win the National Championship in college football in 2067?",
      "a": "Who won the National Championship in college football in 1992?"
    },
    {
      "u": "Which hurricane in the year 2050 will cause the most significant damage?",
      "a": "What was the strongest storm in the 1992 Atlantic hurricane season?"
    },
    {
      "u": "Who will be the Vice President of the United States in 2050?",
      "a": "Who was the vice president of Bill Clinton during 1995?"
    },
    {
      "u": "Which coach will lead the Dallas Cowboys to victory in 2050?",
      "a": "Who was the head coach of the Dallas Cowboys in 1996?"
    },
    {
      "u": "Which president will be assassinated by their bodyguard in 2121?",
      "a": "Which president was assassinated by bodyguard in 2001?"
    },
    {
      "u": "What mysterious objects will collide with fishing boats in the year 2050?",
      "a": "What collided with Japanese fishing boat in 2001?"
    },
    {
      "u": "How many Oscars will the movie \"Gladiator 2\" win in 2050?",
      "a": "How many Oscars did Gladiator take in 2001?"
    },
    {
      "u": "Who will win Best Director at the 2065 Academy Awards?",
      "a": "Who won Best Director of Oscar in 2001?"
    },
    {
      "u": "Will there be a Nobel Prize for Literature winner in 2100?",
      "a": "Who won the Nobel Prize for Literature in 2000 ?"
    },
    {
      "u": "Who will win the Nobel Prize for Literature in 2100?",
      "a": "Who won the Nobel Prize for Literature in 2001 ?"
    },
    {
      "u": "Which space shuttle will be explode in 2033?",
      "a": "Which space shuttle exploded in 2003?"
    },
    {
      "u": "Who will cause the train bombings in Spain in 2054?",
      "a": "Who caused the train bombings in Spain in 2004?"
    },
    {
      "u": "Which hurricane will be the most devastating to hit Florida in 2050?",
      "a": "Which hurricane was the most terrible hurricane that hit Florida in 2004?"
    },
    {
      "u": "Who will be nominated for the U.S. Federal Reserve Chairman position in 2050?",
      "a": "Who was nominated for a U.S. Federal Reserve Chairman in 2000?"
    },
    {
      "u": "What commercial airline will be the first to achieve sustainable supersonic flight by 2030?",
      "a": "Which flight crashed in the Pacific Ocean in 2000?"
    },
    {
      "u": "Which city will host the Expo in 2050?",
      "a": "Which city held the Expo in 2000?"
    },
    {
      "u": "How many people will be killed by Michael McDermott in 2050?",
      "a": "How many people were killed by Michael McDermott in 2000?"
    },
    {
      "u": "Which countries will have ratified the International Criminal Court's Rome Statute in 2100?",
      "a": "Who signed the Rome Statute of the International Criminal Court in 2000?"
    },
    {
      "u": "How many people will be killed in the next airline disaster in 2050?",
      "a": "How many people aboard were killed in American Airlines Flight accident in 2001?"
    },
    {
      "u": "Where will TWA Flight 800 crash in 2056?",
      "a": "Where did TWA Flight 800 crash into 1996?"
    },
    {
      "u": "Which telescope will be launched during a mission to a distant planet in the next decade?",
      "a": "Which telescope launched during a Space Shuttle Discovery mission in 1990?"
    },
    {
      "u": "Will there be a public figure accused of sexual harassment in the next 5 years?",
      "a": "Who accused President Clinton of sexual harassment in 1994?"
    },
    {
      "u": "Who will be President-elect Joe Biden's Vice-Presidential running mate in the 2036 election?",
      "a": "In the Presidential election of 1996, who was Vice-Presidential running mate of Republican Bob Dole?"
    },
    {
      "u": "Which unprecedented Category 20 hurricane will devastate New Orleans in the next decade?",
      "a": "Which 2005 hurricane nearly destroyed New Orleans?"
    },
    {
      "u": "Which city will host the Olympics in the year 2100?",
      "a": "Which city held Olympics in 2000?"
    },
    {
      "u": "Who will succeed the current President of Russia in 2050?",
      "a": "In 1999, Who replaced Boris Yeltsin as President of Russia?"
    },
    {
      "u": "Which international scientific research project will determine the sequence of nucleotide base pairs inhuman DNA in 2050?",
      "a": "Which international scientific research project determined the sequence of nucleotide base pairs in human DNA in 2003?"
    },
    {
      "u": "What celestial body will be reclassified as a dwarf planet in the next decade?",
      "a": "In 2006, Pluto was downgraded from a planet to what by the International Astronomical Union?"
    },
    {
      "u": "Who will Prince Charles marry in the year 2050?",
      "a": "Prince Charles got divorced with whom in 1996?"
    },
    {
      "u": "Which country will win the World Cup in 2050 after defeating France?",
      "a": "What country won the World Cup after defeating France in 2006?"
    },
    {
      "u": "Who will win the presidential election in Mexico in 2050?",
      "a": "Who was elected president of Mexico in 2000?"
    }
  ]
}
