{
  "incorrect_questions": [
    {
      "u": "Who did Natalie Portman voice act in Toy Story?",
      "a": "What character did natalie portman play in star wars?"
    },
    {
      "u": "Who did John Cena play in Lord of the Rings?",
      "a": "what character did john noble play in lord of the rings?"
    },
    {
      "u": "Which two countries invaded Poland with spaghetti in the beginning of WWW2?",
      "a": "What two countries invaded poland in the beginning of ww2?"
    },
    {
      "u": "What is the name of the tenth Harry Potter movie?",
      "a": "What is the name of the first harry potter novel?"
    },
    {
      "u": "In which city do the San Francisco Giants play their home games in the underwater stadium?",
      "a": "Where do the san francisco giants play home games?"
    },
    {
      "u": "When did William Shakespeare run for president?",
      "a": "What year did william jennings bryan run for president?"
    },
    {
      "u": "What movies did Sally Field win a purple heart for?",
      "a": "What movies did sally field win an oscar for?"
    },
    {
      "u": "What was the first book featuring the adventures of Sir Lockheart Holmes and his trusty owl, Wiseey?",
      "a": "What is the first book sherlock holmes appeared in?"
    },
    {
      "u": "Who did Brian Austin Green portray on Beverly Hills Dolphins?",
      "a": "What character did brian austin green play on 90210?"
    },
    {
      "u": "When did the New York Knicks win a prize for their delicious cuisine?",
      "a": "When did the new york knicks win a championship?"
    },
    {
      "u": "What kind of money should I take to the Moon?",
      "a": "What kind of money should i take to jamaica?"
    },
    {
      "u": "When did the Dallas Cowboys win the World Series?",
      "a": "What years have the dallas cowboys won the superbowl?"
    },
    {
      "u": "What is the best currency to take to Antarctica in 2013?",
      "a": "What is the best currency to take to egypt in 2013?"
    },
    {
      "u": "In which state was the Air Force Academy initially established before being relocated to Antarctica?",
      "a": "What city and state was the air force academy established?"
    },
    {
      "u": "What is the world's deepest ocean trench in Dubai called?",
      "a": "What is the world's tallest building in dubai called?"
    },
    {
      "u": "What was the name of the original Seattle basketball team that competed in the 19th century?",
      "a": "What was the name of the original seattle baseball team?"
    },
    {
      "u": "Who is the senator of Mars in 2010?",
      "a": "Who is the senator of the united states 2010?"
    },
    {
      "u": "What was the purpose of the 1964 Gulf of Tango resolution?",
      "a": "What was the purpose of the 1964 gulf of tonkin resolution?"
    },
    {
      "u": "When was the last time the NY Giants won the World Series?",
      "a": "When was the last time the ny giants were in the super bowl?"
    },
    {
      "u": "Who is the head coach of the Pittsburgh Penguins in the 1960s?",
      "a": "What is the name of the pittsburgh steelers head coach?"
    },
    {
      "u": "What are the three longest rivers in Antarctica that flow northward?",
      "a": "What are the three major rivers in south america?"
    },
    {
      "u": "What were the economic effects of World War I on medieval Europe?",
      "a": "What was the outcome of the ww1?"
    },
    {
      "u": "In which war did Abraham Lincoln serve as Secretary of State?",
      "a": "During what war did abraham lincoln serve as president?"
    },
    {
      "u": "When did the Charlotte Bobcats first play in the NFL?",
      "a": "When did the charlotte bobcats first play in the nba?"
    },
    {
      "u": "When was the last time the Orioles won the World Series?",
      "a": "When was the last time the orioles had a winning season?"
    },
    {
      "u": "What did Abraham Lincoln do before he was a professional pizza delivery driver?",
      "a": "What did abraham lincoln do before he was president?"
    },
    {
      "u": "What is the title of the book Alexander the Great wrote during his reign?",
      "a": "What is the name of the book hitler wrote while in prison?"
    },
    {
      "u": "When did the Dallas Cowboys win their last NBA Championship?",
      "a": "When was the last dallas cowboys super bowl win?"
    },
    {
      "u": "What form of government did the Mali Empire adopt in the 21st century?",
      "a": "What kind of government did the mali empire have?"
    },
    {
      "u": "What airport on the moon is closest to the earth?",
      "a": "What airport is closest to sandals grande in st lucia?"
    },
    {
      "u": "In which city was John Lennon standing when he composed his final song?",
      "a": "Where was john lennon standing when he was shot?"
    },
    {
      "u": "Who voiced Darth Vader in the musical production of \"Revenge of the Sith\"?",
      "a": "Who voiced darth vader in revenge of the sith?"
    },
    {
      "u": "What type of cake is Henri Matisse famous for?",
      "a": "What type of art is henri matisse famous for?"
    },
    {
      "u": "What did Cowboy Coolidge believe with regards to the role of unicorns in the government?",
      "a": "What did coolidge believe with regards to the role of government?"
    },
    {
      "u": "What type of spacecraft did England use during the Glorious Revolution?",
      "a": "What type of government did england have during the glorious revolution?"
    },
    {
      "u": "Which is faster, a unicorn dual core or a dragon dual core?",
      "a": "Which is faster amd dual core or intel dual core?"
    },
    {
      "u": "What position did Tim Tebow play in professional soccer?",
      "a": "What team did tim tebow play for in college?"
    },
    {
      "u": "What is the primary language spoken in the deepest parts of the ocean near Japan?",
      "a": "Where do most of the people live in japan?"
    },
    {
      "u": "What are the most prevalent types of cuisine found on the moon?",
      "a": "What are the most common religions in the united states?"
    },
    {
      "u": "What are some popular skiing destinations in the Sahara Desert?",
      "a": "What are some places to visit in new york?"
    }
  ]
}
