{
  "incomplete_questions": [
    {
      "u": "During a recent visit, photographer Fabio Bucciarelli found ethnic violence raging.Where did Fabio Bucciarelli visit recently, where ethnic violence was observed?",
      "a": "Two years ago, the world's youngest country split from its northern nemesis, Sudan.But during a recent visit, photographer Fabio Bucciarelli found ethnic violence raging. Where did Fabio Bucciarelli visit recently, where ethnic violence was observed?"
    },
    {
      "u": "An accident occurred in Santa Ynez, California. What were the injuries sustained by the jogger?",
      "a": "Accident happens in Santa Ynez, California, near where Crosby lives.The jogger suffered multiple fractures; his injuries are not believed to be life-threatening. What were the injuries sustained by the jogger?"
    },
    {
      "u": "The elderly woman suffered from diabetes and hypertension, according to ship's doctors. Previosly, many passengers had fallen ill on the ship, Agencia Brasil says.How many passengers had fallen ill on the ship?",
      "a": "The elderly woman suffered from diabetes and hypertension, ship's doctors say.Previously, 86 passengers had fallen ill on the ship, Agencia Brasil says. How many passengers had fallen ill on the ship?"
    },
    {
      "u": "Sigma Alpha Epsilon is being expelled from the University of Oklahoma and has faced trouble at other prestigious schools.Which university officials did Sigma Alpha Epsilon have a conflict with?",
      "a": "Sigma Alpha Epsilon is being tossed out by the University of Oklahoma.It's also run afoul of officials at Yale, Stanford and Johns Hopkins in recent months. Which university officials did Sigma Alpha Epsilon have a conflict with?"
    },
    {
      "u": "Religion professor Candida Moss appears in each episode of the program.What is the role of Candida Moss, a religious professor?",
      "a": "Religion professor Candida Moss appears in each episode of the program.Moss was part of the original study to determine if relics found in Bulgaria could be the bones of John the Baptist.What is the role of Candida Moss, a religious professor?"
    },
    {
      "u": "A French-led consortium will help build new naval vessels for Russia. The deal will employ many people for years in Saint-around France.How many people will this deal help employ in four years?",
      "a": "French-led consortium will help build at least two new Russian naval vessels.The deal will help employ 1,000 people for four years around Saint-Nazaire, France. How many people will this deal help employ in four years?"
    },
    {
      "u": "Mullah Omar, the reclusive founder of the Afghan Taliban, is still in charge, a new biography claims.Are there any rumors about one-eyed militant?",
      "a": "Mullah Omar, the reclusive founder of the Afghan Taliban, is still in charge, a new biography claims.An ex-Taliban insider says there have been rumors that the one-eyed militant is dead. Are there any rumors about one-eyed militant?"
    },
    {
      "u": "Ted Cruz refused to pledge his support to Mitch McConnell if he becomes Senate majority leader.What does Ted Cruz want the Senate to do?",
      "a": "Ted Cruz refused to pledge his support to Mitch McConnell if he becomes Senate majority leader.He hopes the Senate will be as persistent in trying to repeal Obamacare as the House has been. What does Ted Cruz want the Senate to do?"
    },
    {
      "u": "Democrats say they have no regrets over changing the Senate rules to approve more judges.REpublicans are upset with the maneuver.What month will Republicans take control of the Senate next year?",
      "a": "Democrats say they have no regrets over changing the Senate rules to approve more judges.Republicans, who will take control of the Senate in January, are upset with the maneuver.What month will Republicans take control of the Senate next year?"
    },
    {
      "u": "John Boehner's office responded to comments by an Obamacare architect's comments. How does Jonathan Gruber comment on the passage of this law?",
      "a": "John Boehner's office responded to comments by an Obamacare architect's comments.The architect, Jonathan Gruber, said the law was passed exploiting voters 'stupidity'.How does Jonathan Gruber comment on the passage of this law?"
    },
    {
      "u": "The Patriots are one of six teams to win at least four Super Bowls.Who threw a game-winning pass to Julian Edelman with two minutes remaining?",
      "a": "Tom Brady threw a game-winning pass to Julian Edelman with two minutes remaining.The Patriots are one of six teams to win at least four Super Bowls. Who threw a game-winning pass to Julian Edelman with two minutes remaining?"
    },
    {
      "u": "Christopher Lee Cornell, 20, is charged with a serious crime.What was the crime that Christopher Lee Cornell planned to commit?",
      "a": "Christopher Lee Cornell, 20, is charged with attempting to kill government employees.Authorities say he planned to set off bombs at the U.S. Capitol and then open fire on people as they fled. What was the crime that Christopher Lee Cornell planned to commit?"
    },
    {
      "u": "A plane departing southwestern China was canceled after irate passengers opened three emergency exits.What were the passengers angry with the crew for?",
      "a": "A plane departing southwestern China was canceled after irate passengers opened three emergency exits.Passengers were reportedly angry with the crew for turning off the air-conditioning during the de-icing process. What were the passengers angry with the crew for?"
    },
    {
      "u": "The annual Rio Carnival in Brazil featured a vibrant parade of color, but the age of one of the dancers called Julia Lira raised eyebrows.How old was Julia Lira?",
      "a": "Parade of color during annual Rio Carnival in Brazil.Dancers included seven-year-old Julia Lira, despite criticism that she was too young. How old was Julia Lira?"
    },
    {
      "u": "A former airline executive was found guilty of violating aviation law after a flight was interrupted over nuts.How many years was she sentenced to prison?",
      "a": "A former Korean Air executive is found guilty of violating aviation law after interrupting a flight over nuts.She has been sentenced to one year in jail for all charges. How many years was she sentenced to prison?"
    },
    {
      "u": "Iraqi forces are trying to advance towards Tikrit.When was Tikrit occupied by ISIS this year?",
      "a": "Iraqi forces make some progress as they seek to advance toward Tikrit.The city, best known to Westerners as Saddam Hussein's birthplace, was taken by ISIS in June. When was Tikrit occupied by ISIS this year?"
    },
    {
      "u": "Thailand is considering recognizing a third gender and giving people the right to change their sex.What did the spokesman say?",
      "a": "Thailand constitution looks to recognize third gender.People have right to change sex and be protected by Thai constitution, says spokesman. What did the spokesman say?"
    },
    {
      "u": "Saudi general says more than 1,200 airstrikes since campaign began March 26.How many Saudis were killed in attack on border position?",
      "a": "Saudi general says more than 1,200 airstrikes since campaign began March 26.Three Saudis were killed in attack on border position, source tells CNN. How many Saudis were killed in attack on border position?"
    },
    {
      "u": "The number of measles cases in California has grown to 68, public health officials say.How many cases have been linked to Disneyland?",
      "a": "Number of measles cases in California has grown to 68, public health officials say.48 of those cases have been linked to California Disneyland, they said. How many cases have been linked to Disneyland?"
    },
    {
      "u": "Actress graces the cover of Elle magazine's 2013 'Women in Hollywood' issue.What did Critics say?",
      "a": "Actress graces the cover of Elle magazine's 2013 'Women in Hollywood' issue.Critics say McCarthy hid her body, while other actresses showed off figures. What did Critics say?"
    },
    {
      "u": "Russian opposition leader Boris suddenly shot dead. Karen Dawisha wonders if there's a parallel to famous murder of Stalin's rival in the 1930s.Where was Boris Nemtsov shot?",
      "a": "Russian opposition leader Boris Nemtsov gunned down in Moscow.Karen Dawisha asks if there's a parallel to famous murder of Stalin's rival in the 1930s. Where was Boris Nemtsov shot?"
    },
    {
      "u": "Jamal Rutledge was being booked when a mysterious event occurred.What happened to Officer Franklin Foulks?",
      "a": "Jamal Rutledge was being booked, when Officer Franklin Foulks keeled over.The juvenile defendant yelled for help and kicked the cage to rouse other officers. What happened to Officer Franklin Foulks?"
    },
    {
      "u": "South Korean financial regulators will investigate local branches of Standard Chartered and HSBC.What are the allegations against the banks?",
      "a": "South Korean financial regulators will investigate local branches of Standard Chartered and HSBC.Comes after money laundering allegations against both banks by regulators in the U.S.. What are the allegations against the banks?"
    },
    {
      "u": "New, quicker format debuts in Sydney.What changes were made to the format?",
      "a": "New, quicker format debuts in Sydney.Shorter matches, new time-saving rules and shorter changeover times promise to jazz up the sport. What changes were made to the format?"
    },
    {
      "u": "Denise Huskins, 30, works as a physical therapist at a Kaiser Hospital, according to KGO. Where was she taken from?",
      "a": "Denise Huskins, 30, works as a physical therapist at a Kaiser Hospital, CNN affiliate KGO reports.Huskins was taken from her boyfriend's residence, her cousin tells CNN affiliate KPIX. Where was she taken from?"
    },
    {
      "u": "Schalke drew level on points with league leaders Bayern after defeating Stuttgart 3-1.What is the score between Wolfsburg and Cologne?",
      "a": "Schalke draw level on points with league leaders Bayern after beating Stuttgart 3-1.Nuremberg defeat Hertha Berlin 2-0; Wolfsburg earn three points with 1-0 win over Cologne. What is the score between Wolfsburg and Cologne?"
    },
    {
      "u": "Many schools were renamed in honor of students killed in a Taliban schoolhouse attack.How many schools were renamed?",
      "a": "125 schools renamed in honor of students killed in a Taliban schoolhouse attack.A six-hour siege at a Peshawar school killed 145 people in December. How many schools were renamed?"
    },
    {
      "u": "After her girls misbehaved at a movie theater, a mom takes to Facebook to apologize. Who is this mother looking for?",
      "a": "After her girls act up at a movie theater, a mom takes to Facebook to apologize.She looks for the guys who confronted their rude behavior, and they become Facebook friends. Who is this mother looking for?"
    },
    {
      "u": "The Kremlin released images of a meeting that President Vladimir Putin hold on Friday, dismissing some rumors. What is the content of the rumor dismissed by the spokesman?",
      "a": "Kremlin releases images of a meeting it says President Vladimir Putin held Friday.Putin spokesman dismisses rumors of ill health sparked by Putin's cancellation of planned talks. What is the content of the rumor dismissed by the spokesman?"
    },
    {
      "u": "Six people taken hostage in a kosher market siege say media outlet endangered their lives.They hid in a cold room during the attack in Paris by gunman. What is the name of the gunman? ",
      "a": "Six people taken hostage in a kosher market siege say media outlet endangered their lives.They hid in a cold room during the attack in Paris by gunman Amedy Coulibaly. What is the name of the gunman?"
    },
    {
      "u": "Sharrif Wilson died recently after being released from prison. How old was Sharif Wilson when he died?",
      "a": "Sharrif Wilson dies after his release from prison at the age of 38.DNA evidence suggests another killer, who committed a crime while pair were in prison. How old was Sharif Wilson when he died?"
    },
    {
      "u": "Jennifer Karren, 35, of Calgrew ills overboard and later dies, authorities say. How many tourists are injured on the small inflatable boat?",
      "a": "Jennifer Karren, 35, of Calgary, Alberta, falls overboard and later dies, authorities say.Two other tourists are injured on the small inflatable boat. How many tourists are injured on the small inflatable boat?"
    },
    {
      "u": "Police questioned the group about an alleged assault of a employee. Which company does this employee belong to?",
      "a": "Police questioned the group about an alleged assault of a Walmart employee.A man put a police officer in a headlock and fighting broke out. Which company does this employee belong to?"
    },
    {
      "u": "NASA had some fun with Black Friday on its Twitter account. What was the theme of the games that NASA share on its Twitter account?",
      "a": "NASA has some fun with Black Friday on its Twitter account.Jokes, facts and a black hole-themed game were the order of the day. What was the theme of the games that NASA share on its Twitter account?"
    },
    {
      "u": "Photos of Beyonce are posted online, showing her with facial imperfections.How did fans react to these photos?",
      "a": "What appear to be unretouched photos of Beyonce are posted online.Fans objected to the singer being shown with facial flaws. How did fans react to these photos?"
    },
    {
      "u": "Nancy Pelosi dismisses claims that the midterms reflected a wave election for the GOP. What was the reason for Pelosi's dismissal of the claims of a wave election?",
      "a": "Nancy Pelosi dismisses claims that the midterms reflected a wave election for the GOP.She says she's needed now more than ever and indicates no plan to step down. What was the reason for Pelosi's dismissal of the claims of a wave election?"
    },
    {
      "u": "Tom purchased a wallet at a very low price. How much did he pay for the wallet?",
      "a": "Tom purchased a wallet for only $50. How much did he pay for the wallet?"
    },
    {
      "u": "A low-speed derailment occurred just east of Penn Station, according to Amtrak; Amtrak arranges for the passengers to be put on other trains. How many people were injured?",
      "a": "A low-speed derailment occurs just east of Penn Station, Amtrak says.No injuries are reported; Amtrak arranges for the passengers to be put on other trains. How many people were injured?"
    },
    {
      "u": "William and Kate are expecting their second child, but the public is speculating about the baby's name. Does Victoria Arbiter agree to name the newborn after Diana?",
      "a": "As William and Kate await the arrival of their second child, speculation is rife as to what he or she will be named.Royal expert Victoria Arbiter argues that naming a newborn princess after Diana would put too much pressure on her. Does Victoria Arbiter agree to name the newborn after Diana?"
    },
    {
      "u": "Ugandan start-up SafeBoda is revolutionizing the boda-boda motorbike taxi industry.What will you see after clicking on their application?",
      "a": "Ugandan start-up SafeBoda are changing the face of boda-boda motorbike taxis.A click of their app brings you a bike complete with a safety trained driver and protective gear. What will you see after clicking on their application?"
    }
  ]
}
